
[H7AcademyTownNames H7GenericTownNames]
mTownNames[0]="Атам"
mTownNames[1]="Фидаа"
mTownNames[2]="Тарра"
mTownNames[3]="Омран"
mTownNames[4]="Кайс"
mTownNames[5]="Бахия"
mTownNames[6]="Хадия"
mTownNames[7]="Ямн"
mTownNames[8]="Надхар"
mTownNames[9]="Хикм"
mTownNames[10]="Сиам"
mTownNames[11]="Яхн"
mTownNames[12]="Йохара"
mTownNames[13]="Зияд"
mTownNames[14]="Матаз"
mTownNames[15]="Ясаар"
mTownNames[16]="Яфия"
mTownNames[17]="Наввал"
mTownNames[18]="Тарфа"
mTownNames[19]="Такиб"
mTownNames[20]="Анваар"
mTownNames[21]="Янаан"
mTownNames[22]="Аст"
mTownNames[23]="Азхар"
[H7DungeonTownNames H7GenericTownNames]
mTownNames[0]="Вирбет"
mTownNames[1]="Йешад"
mTownNames[2]="Талмон"
mTownNames[3]="Сверистал"
mTownNames[4]="Шанност"
mTownNames[5]="Сорфал"
mTownNames[6]="Эфельнур"
mTownNames[7]="Колрис"
mTownNames[8]="Фирингил"
mTownNames[9]="Летост"
mTownNames[10]="Сейшнек"
mTownNames[11]="Шамал"
mTownNames[12]="Шансил"
mTownNames[13]="Гибирнур"
mTownNames[14]="Ристайрис"
mTownNames[15]="Талгат"
mTownNames[16]="Химаннан"
mTownNames[17]="Иланхар"
mTownNames[18]="Салгюнсал"
mTownNames[19]="Йон-Чал"
mTownNames[20]="Миртин"
mTownNames[21]="Тилост"
mTownNames[22]="Талостра"
mTownNames[23]="Ванталост"
mTownNames[24]="Тралсин"
mTownNames[25]="Торост"
mTownNames[26]="Пелнур"
mTownNames[27]="Халад"
mTownNames[28]="Маллост"
mTownNames[29]="Тилгатал"
mTownNames[30]="Эррост"
mTownNames[31]="Тралост"
mTownNames[32]="Наррост"
mTownNames[33]="Менност"
[H7HavenTownNames H7GenericTownNames]
mTownNames[0]="Эшвик"
mTownNames[1]="Эшвуд"
mTownNames[2]="Бэйли"
mTownNames[3]="Баррингтон"
mTownNames[4]="Брукшир"
mTownNames[5]="Грейсвилль"
mTownNames[6]="Желтый дол"
mTownNames[7]="Балмвилль"
mTownNames[8]="Бэйворт"
mTownNames[9]="Пограничье"
mTownNames[10]="Яснолесье"
mTownNames[11]="Каслгейт"
mTownNames[12]="Чилбори"
mTownNames[13]="Когстон"
mTownNames[14]="Крадл"
mTownNames[15]="Дейш"
mTownNames[16]="Данмур"
mTownNames[17]="Эйриг"
mTownNames[18]="Двуречье"
mTownNames[19]="Гленхайм"
mTownNames[20]="Грейстоун"
mTownNames[21]="Грифоний холм"
mTownNames[22]="Хардвик"
mTownNames[23]="Пейлспринг"
mTownNames[24]="Затерянный дол"
mTownNames[25]="Мерлон"
mTownNames[26]="Миллфилд"
mTownNames[27]="Новый дозор"
mTownNames[28]="Сумеречногорье"
mTownNames[29]="Шеллер"
mTownNames[30]="Виджил"
mTownNames[31]="Штормдейл"
mTownNames[32]="Стронгбоу"
mTownNames[33]="Торнхэм"
mTownNames[34]="Чистолесье"
mTownNames[35]="Приречье"
mTownNames[36]="Вествол"
[H7NecropolisTownNames H7GenericTownNames]
mTownNames[0]="Набу-Шума"
mTownNames[1]="Адад-Усур"
mTownNames[2]="Энлил-Садага"
mTownNames[3]="Даввес"
mTownNames[4]="Эриба-Ишкан"
mTownNames[5]="Аби-Либар"
mTownNames[6]="Нинурта-Юсар"
mTownNames[7]="Аппил-Сейн"
mTownNames[8]="Шагаракти"
mTownNames[9]="Надин-Закир"
mTownNames[10]="Кадашман"
mTownNames[11]="Лалум"
mTownNames[12]="Суму-Ирркин"
mTownNames[13]="Латро"
mTownNames[14]="Надин-Йешах"
mTownNames[15]="Амми-Йешах"
mTownNames[16]="Эа-Дитана"
mTownNames[17]="Нар-Анкар"
mTownNames[18]="Нар-Ишкан"
mTownNames[19]="Амель-Ишкан"
mTownNames[20]="Амми-Садака"
mTownNames[21]="Бел-Зери"
mTownNames[22]="Саррект"
mTownNames[23]="Аппал-Шиппак"
mTownNames[24]="Ашул-Гамиль"
mTownNames[25]="Бел-Эбни"
mTownNames[26]="Адад-Шума"
[H7StrongholdTownNames H7GenericTownNames]
mTownNames[0]="Ньяни"
mTownNames[1]="Ндеге"
mTownNames[2]="Ньяти"
mTownNames[3]="Пака"
mTownNames[4]="Дамма"
mTownNames[5]="Сокве"
mTownNames[6]="Нгомбе"
mTownNames[7]="Паа"
mTownNames[8]="Мбва"
mTownNames[9]="Пунда"
mTownNames[10]="Тембо"
mTownNames[11]="Твига"
mTownNames[12]="Мбази"
mTownNames[13]="Кибоко"
mTownNames[14]="Фисси"
mTownNames[15]="Свалла"
mTownNames[16]="Чуи"
mTownNames[17]="Кима"
mTownNames[18]="Мбуни"
mTownNames[19]="Тауси"
mTownNames[20]="Нгараве"
mTownNames[21]="Чатту"
mTownNames[22]="Кифару"
mTownNames[23]="Конду"
mTownNames[24]="Ньока"
mTownNames[25]="Нгири"
mTownNames[26]="Нгараве-Мвиту"
mTownNames[27]="Мбва-Мвиту"
mTownNames[28]="Пунда-Милья"
[H7SylvanTownNames H7GenericTownNames]
mTownNames[0]="Дамлад"
mTownNames[1]="Дираэн"
mTownNames[2]="Эревел"
mTownNames[3]="Альтир"
mTownNames[4]="Гиладан"
mTownNames[5]="Халлин"
mTownNames[6]="Фириос"
mTownNames[7]="Венлан"
mTownNames[8]="Анфаль"
mTownNames[9]="Сайлина"
mTownNames[10]="Менсил"
mTownNames[11]="Винлад"
mTownNames[12]="Нарргорад"
mTownNames[13]="Шалайя"
mTownNames[14]="Раэль"
mTownNames[15]="Фалтиль"
mTownNames[16]="Янтиль"
mTownNames[17]="Аглан"
mTownNames[18]="Виннтил"
mTownNames[19]="Талирн"
[H7FortressTownNames H7GenericTownNames]
mTownNames[0]="Асбранд"
mTownNames[1]="Бьорнгейр"
mTownNames[2]="Фрейварр"
mTownNames[3]="Гермир"
mTownNames[4]="Гудмунд"
mTownNames[5]="Хирватильд"
mTownNames[6]="Вемсдал"
mTownNames[7]="Хиркольф"
mTownNames[8]="Айсгерд"
mTownNames[9]="Ингмунд"
mTownNames[10]="Кнудд"
mTownNames[11]="Мерасгард"
mTownNames[12]="Рунгерд"
mTownNames[13]="Скельд"
mTownNames[14]="Стэйнарр"
mTownNames[15]="Тйоркмир"
mTownNames[16]="Торбйорн"
mTownNames[17]="Трварральд"
mTownNames[18]="Торгерд"
mTownNames[19]="Ульфсон"
